GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
/* How long to wait for ANY link (Ethernet or Wi-Fi) before falling back to
 * the setup AP (#1 — see start_setup_ap). Matches upstream ESP32_AdBlocker's
 * own wifiTimeoutSecs default (30s) closely enough; this device also has
 * Ethernet racing in parallel, so most real boots never reach this wait. */
#define WIFI_SETUP_AP_TIMEOUT_MS 30000

extern "C" bool dns_sink_wifi_built(void)
{
#if CONFIG_ADBLOCK_NET_WIFI
    return true;
#else
    return false;
#endif
}

/* Populate current interface IPs + active upstream selection for the web UI. */
extern "C" void dns_sink_net_status(char *iface, size_t iface_cap,
                                     char *eth_ip, size_t eth_cap,
                                     char *wifi_ip, size_t wifi_cap)
{
    if (iface) snprintf(iface, iface_cap, "%s", s_upstream_iface);
    if (eth_ip) snprintf(eth_ip, eth_cap, "%s", s_ip);
#if CONFIG_ADBLOCK_NET_WIFI
    if (wifi_ip) snprintf(wifi_ip, wifi_cap, "%s", s_wifi_ip);
#else
    if (wifi_ip && wifi_cap) wifi_ip[0] = '\0';
#endif
}

/* Recompute which resolver is the active upstream and push it live — no DNS
 * task restart, in-flight queries are unaffected (see DnsSinkServer::set_upstream).
 *
 * Upstream = the DHCP-provided DNS server (option 6) for the selected
 * interface, NOT its gateway. On a typical home router these are often the
 * same box, but on a mobile-hotspot/CGNAT connection (the Cox link this was
 * built for) they're not: the gateway is a bare NAT hop with no resolver at
 * all, while DHCP still hands out real, working DNS server IPs separately
 * (observed: gw 100.72.0.1 doesn't answer on :53; DNS servers 68.2.16.25/.30
 * do). Falls back to the gateway, then to 1.1.1.1, only if DHCP genuinely
 * didn't provide a DNS server. */
static const char *pick_upstream(const char *dns, const char *gw)
{
    if (dns[0] != '\0') return dns;
    if (gw[0]  != '\0') return gw;
    return "1.1.1.1";
}

/* Returns the upstream it settled on, so a caller can log the value that is
 * actually live rather than one it computed separately (#80). Existing callers
 * ignore the return; nothing else changes for them. */
static const char *apply_upstream_iface(void)
{
    const char *upstream = pick_upstream(s_eth_dns, s_gw);
#if CONFIG_ADBLOCK_NET_WIFI
    if (strcmp(s_upstream_iface, "wifi") == 0)
        upstream = pick_upstream(s_wifi_dns, s_wifi_gw);
#endif
    s_dns.set_upstream(upstream);
    return upstream;
}

/* Called from web_ui.cpp POST /net/upstream. Returns false on an invalid or
 * unavailable (not built / not yet connected) interface — caller keeps the
 * previous setting in that case. */
extern "C" bool dns_sink_set_upstream_iface(const char *iface)
{
    if (!iface) return false;
    if (strcmp(iface, "eth") != 0
#if CONFIG_ADBLOCK_NET_WIFI
        && strcmp(iface, "wifi") != 0
#endif
    ) return false;

    snprintf(s_upstream_iface, sizeof(s_upstream_iface), "%s", iface);

    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) == ESP_OK) {
        nvs_set_str(h, NVS_KEY_UPIF, s_upstream_iface);
        nvs_commit(h);
        nvs_close(h);
    }
    apply_upstream_iface();
    return true;
}

static void upstream_iface_init_nvs(void)
{
#if CONFIG_ADBLOCK_NET_WIFI
    snprintf(s_upstream_iface, sizeof(s_upstream_iface), "wifi");  /* default when built dual-stack */
#endif
    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) return;
    size_t len = sizeof(s_upstream_iface);
    nvs_get_str(h, NVS_KEY_UPIF, s_upstream_iface, &len);
    nvs_close(h);
}

/* ── Static IP vs DHCP (#55) ────────────────────────────────────────────
 * Applied only at boot — no live DHCP-client-state transition on a running
 * netif, which is the risky part (stopping/starting dhcpc mid-flight can
 * wedge the netif). Changing a form field here just persists to NVS; the
 * web UI's save action tells the user to reboot to apply, same as most
 * router admin panels handle this exact class of change. */
struct NetStaticCfg {
    bool dhcp = true;
    char ip[16]  = {};
    char nm[16]  = {};
    char gw[16]  = {};
    char dns[16] = {};
};

/* Loaded once at bring-up, then read by the link-up handlers to publish the
 * address at the right moment (see publish_static_eth/publish_static_wifi). */
static NetStaticCfg s_eth_static;

static void netcfg_load(const char *prefix, NetStaticCfg *cfg)
{
    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READONLY, &h) != ESP_OK) return;
    char key[24];
    uint8_t mode = 1;   /* default: DHCP */
    snprintf(key, sizeof(key), "%s_mode", prefix); nvs_get_u8(h, key, &mode);
    cfg->dhcp = (mode != 0);
    size_t len;
    len = sizeof(cfg->ip);  snprintf(key, sizeof(key), "%s_ip",  prefix); nvs_get_str(h, key, cfg->ip,  &len);
    len = sizeof(cfg->nm);  snprintf(key, sizeof(key), "%s_nm",  prefix); nvs_get_str(h, key, cfg->nm,  &len);
    len = sizeof(cfg->gw);  snprintf(key, sizeof(key), "%s_gw",  prefix); nvs_get_str(h, key, cfg->gw,  &len);
    len = sizeof(cfg->dns); snprintf(key, sizeof(key), "%s_dns", prefix); nvs_get_str(h, key, cfg->dns, &len);
    nvs_close(h);
}

/* Called from web_ui.cpp POST /net/{eth,wifi}/set. iface = "eth" or "wifi". */
extern "C" bool dns_sink_net_set_static(const char *iface, bool dhcp,
                                         const char *ip, const char *nm,
                                         const char *gw, const char *dns_ip)
{
    if (strcmp(iface, "eth") != 0 && strcmp(iface, "wifi") != 0) return false;
    if (!dhcp) {
        struct in_addr a;
        if (!ip || !inet_aton(ip, &a)) return false;
        if (!nm || !inet_aton(nm, &a)) return false;
        if (gw && gw[0] && !inet_aton(gw, &a)) return false;
        if (dns_ip && dns_ip[0] && !inet_aton(dns_ip, &a)) return false;
    }
    nvs_handle_t h;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) != ESP_OK) return false;
    char key[24];
    snprintf(key, sizeof(key), "%s_mode", iface); nvs_set_u8(h, key, dhcp ? 1 : 0);
    snprintf(key, sizeof(key), "%s_ip",   iface); nvs_set_str(h, key, ip ? ip : "");
    snprintf(key, sizeof(key), "%s_nm",   iface); nvs_set_str(h, key, nm ? nm : "");
    snprintf(key, sizeof(key), "%s_gw",   iface); nvs_set_str(h, key, gw ? gw : "");
    snprintf(key, sizeof(key), "%s_dns",  iface); nvs_set_str(h, key, dns_ip ? dns_ip : "");
    nvs_commit(h);
    nvs_close(h);
    return true;
}

/* Populate current NVS-stored config for the web UI form (not necessarily
 * what's active right now if it hasn't been rebooted since a change). */
extern "C" void dns_sink_net_get_static(const char *iface, bool *dhcp,
                                         char *ip, size_t ip_cap,
                                         char *nm, size_t nm_cap,
                                         char *gw, size_t gw_cap,
                                         char *dns_ip, size_t dns_cap)
{
    NetStaticCfg cfg;
    netcfg_load(iface, &cfg);
    if (dhcp) *dhcp = cfg.dhcp;
    if (ip)     snprintf(ip,     ip_cap,  "%s", cfg.ip);
    if (nm)     snprintf(nm,     nm_cap,  "%s", cfg.nm);
    if (gw)     snprintf(gw,     gw_cap,  "%s", cfg.gw);
    if (dns_ip) snprintf(dns_ip, dns_cap, "%s", cfg.dns);
}

/* Live addressing for an interface — the DHCP lease as it arrived, or the
 * static config once the link actually came up. The web UI prefills the
 * static-IP form from this when the interface is in DHCP mode, so "go
 * static, keep this address" is just picking the radio and hitting Save.
 * Empty strings while the interface is down. */
extern "C" void dns_sink_net_get_current(const char *iface,
                                          char *ip, size_t ip_cap,
                                          char *nm, size_t nm_cap,
                                          char *gw, size_t gw_cap,
                                          char *dns_ip, size_t dns_cap)
{
    const char *cip = "", *cnm = "", *cgw = "", *cdns = "";
    if (strcmp(iface, "eth") == 0) {
        cip = s_ip; cnm = s_nm; cgw = s_gw; cdns = s_eth_dns;
    }
#if CONFIG_ADBLOCK_NET_WIFI
    else if (strcmp(iface, "wifi") == 0) {
        cip = s_wifi_ip; cnm = s_wifi_nm; cgw = s_wifi_gw; cdns = s_wifi_dns;
    }
#endif
    if (ip)     snprintf(ip,     ip_cap,  "%s", cip);
    if (nm)     snprintf(nm,     nm_cap,  "%s", cnm);
    if (gw)     snprintf(gw,     gw_cap,  "%s", cgw);
    if (dns_ip) snprintf(dns_ip, dns_cap, "%s", cdns);
}

extern "C" void dns_sink_reboot(void)
{
    esp_restart();
}

/* Stop the netif's DHCP client and push a static IP/netmask/gateway/DNS.
 * Must run before esp_eth_start()/esp_wifi_connect() — dhcpc_stop() on an
 * already-running client mid-connection is the unsupported transition that
 * risks wedging the netif; doing it here, before the link/radio is even up,
 * avoids that entirely. */
static void apply_static_ip(esp_netif_t *netif, const NetStaticCfg &cfg)
{
    esp_err_t rc = esp_netif_dhcpc_stop(netif);
    if (rc != ESP_OK && rc != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED)
        ESP_LOGW(TAG, "dhcpc_stop: %s", esp_err_to_name(rc));

