GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    esp_netif_ip_info_t ipinfo = {};
    struct in_addr a;
    inet_aton(cfg.ip, &a); ipinfo.ip.addr = a.s_addr;
    inet_aton(cfg.nm, &a); ipinfo.netmask.addr = a.s_addr;
    if (cfg.gw[0]) { inet_aton(cfg.gw, &a); ipinfo.gw.addr = a.s_addr; }
    ESP_ERROR_CHECK(esp_netif_set_ip_info(netif, &ipinfo));

    if (cfg.dns[0]) {
        esp_netif_dns_info_t dns_info = {};
        dns_info.ip.type = ESP_IPADDR_TYPE_V4;
        inet_aton(cfg.dns, &a); dns_info.ip.u_addr.ip4.addr = a.s_addr;
        esp_netif_set_dns_info(netif, ESP_NETIF_DNS_MAIN, &dns_info);
    }
}

/* Publish a statically-configured interface's address — deferred to the
 * link-up event rather than done at config time (#56). A static netif never
 * fires IP_EVENT_*_GOT_IP, so the "got IP" bit has to be raised by hand; doing
 * it at config time (before esp_eth_start/esp_wifi_start) made app_main declare
 * the network ready and pin upstream DNS to the static gateway while the link
 * was still down — observed answering on 192.168.50.10 with the port empty,
 * which leaves every forwarded query timing out on an Ethernet-only build. */
static void publish_static_eth(void)
{
    if (s_eth_static.dhcp) return;
    snprintf(s_ip,      sizeof(s_ip),      "%s", s_eth_static.ip);
    snprintf(s_nm,      sizeof(s_nm),      "%s", s_eth_static.nm);
    snprintf(s_gw,      sizeof(s_gw),      "%s", s_eth_static.gw);
    snprintf(s_eth_dns, sizeof(s_eth_dns), "%s", s_eth_static.dns);
    ESP_LOGI(TAG, "Ethernet link up — static IP: %s  GW: %s  DNS: %s",
             s_ip, s_gw[0] ? s_gw : "(none)", s_eth_dns[0] ? s_eth_dns : "(none)");
    s_eth_ip_nbo.store(inet_addr(s_eth_static.ip), std::memory_order_relaxed);
    xEventGroupSetBits(s_eth_eg, ETH_GOT_IP_BIT);
    apply_upstream_iface();
}

/* ── Ethernet event handlers ─────────────────────────────────────── */
static void eth_event_handler(void *, esp_event_base_t, int32_t event_id, void *)
{
    if (event_id == ETHERNET_EVENT_CONNECTED) {
        xEventGroupSetBits(s_eth_eg, ETH_CONNECTED_BIT);
        publish_static_eth();      /* no-op under DHCP — the lease drives it instead */
    } else if (event_id == ETHERNET_EVENT_DISCONNECTED) {
        xEventGroupClearBits(s_eth_eg, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT);
        s_eth_ip_nbo.store(0, std::memory_order_relaxed);   /* (#106) hook defers while down */
        if (!s_eth_static.dhcp) { s_ip[0] = '\0'; s_nm[0] = '\0'; s_gw[0] = '\0'; s_eth_dns[0] = '\0'; }
    }
}

/* Read the DHCP-provided DNS server (option 6) for a netif, if any. */
static void fetch_dhcp_dns(esp_netif_t *netif, char *out, size_t cap)
{
    esp_netif_dns_info_t dns{};
    if (esp_netif_get_dns_info(netif, ESP_NETIF_DNS_MAIN, &dns) == ESP_OK
        && dns.ip.type == ESP_IPADDR_TYPE_V4 && dns.ip.u_addr.ip4.addr != 0) {
        esp_ip4addr_ntoa(&dns.ip.u_addr.ip4, out, cap);
    } else {
        out[0] = '\0';
    }
}

#if CONFIG_ADBLOCK_NET_WIFI
static void stop_setup_ap_if_active(void);   /* defined below wifi_creds_init_nvs (#1) */
#endif

static void ip_event_handler(void *, esp_event_base_t, int32_t event_id, void *event_data)
{
    if (event_id == IP_EVENT_ETH_GOT_IP) {
        auto *ev = static_cast<ip_event_got_ip_t *>(event_data);
        esp_ip4addr_ntoa(&ev->ip_info.ip, s_ip, sizeof(s_ip));
        s_eth_ip_nbo.store(ev->ip_info.ip.addr, std::memory_order_relaxed);   /* (#106) */
        esp_ip4addr_ntoa(&ev->ip_info.netmask, s_nm, sizeof(s_nm));
        esp_ip4addr_ntoa(&ev->ip_info.gw, s_gw, sizeof(s_gw));
        fetch_dhcp_dns(ev->esp_netif, s_eth_dns, sizeof(s_eth_dns));
        ESP_LOGI(TAG, "Ethernet IP: %s  GW: %s  DNS: %s", s_ip, s_gw, s_eth_dns[0] ? s_eth_dns : "(none)");
        xEventGroupSetBits(s_eth_eg, ETH_GOT_IP_BIT);
        apply_upstream_iface();
#if CONFIG_ADBLOCK_NET_WIFI
        stop_setup_ap_if_active();
#endif
    }
#if CONFIG_ADBLOCK_NET_WIFI
    else if (event_id == IP_EVENT_STA_GOT_IP) {
        auto *ev = static_cast<ip_event_got_ip_t *>(event_data);
        esp_ip4addr_ntoa(&ev->ip_info.ip, s_wifi_ip, sizeof(s_wifi_ip));
        esp_ip4addr_ntoa(&ev->ip_info.netmask, s_wifi_nm, sizeof(s_wifi_nm));
        esp_ip4addr_ntoa(&ev->ip_info.gw, s_wifi_gw, sizeof(s_wifi_gw));
        fetch_dhcp_dns(ev->esp_netif, s_wifi_dns, sizeof(s_wifi_dns));
        ESP_LOGI(TAG, "Wi-Fi IP: %s  GW: %s  DNS: %s", s_wifi_ip, s_wifi_gw, s_wifi_dns[0] ? s_wifi_dns : "(none)");
        xEventGroupSetBits(s_eth_eg, WIFI_GOT_IP_BIT);
        apply_upstream_iface();
        stop_setup_ap_if_active();
    }
#endif
}

#if CONFIG_ADBLOCK_NET_WIFI
/* ── Wi-Fi credentials: NVS-backed, Kconfig only as first-boot seed ──────
 * CONFIG_ADBLOCK_WIFI_SSID/PASSWORD used to be read directly at connect
 * time, which made the credentials permanently build-time-fixed. Runtime
 * reconfiguration (GUI network picker, #54) needs them in NVS instead; on
 * first boot (NVS empty) we seed from Kconfig once and persist that, so an
 * existing build's behavior is unchanged until someone actually reconfigures. */
static char s_wifi_ssid[33] = {};   /* 32 + NUL, per 802.11 max SSID length */
static char s_wifi_pass[65] = {};   /* 64 + NUL, per WPA2-PSK max */

static void wifi_creds_init_nvs(void)
{
    nvs_handle_t h;
    bool have_ssid = false;
    if (nvs_open(NVS_NS, NVS_READONLY, &h) == ESP_OK) {
        size_t len = sizeof(s_wifi_ssid);
        if (nvs_get_str(h, "wifi_ssid", s_wifi_ssid, &len) == ESP_OK && s_wifi_ssid[0] != '\0')
            have_ssid = true;
        len = sizeof(s_wifi_pass);
        nvs_get_str(h, "wifi_pass", s_wifi_pass, &len);
        nvs_close(h);
    }
    if (!have_ssid) {
        ESP_LOGI(TAG, "No Wi-Fi creds in NVS — seeding from Kconfig default");
        snprintf(s_wifi_ssid, sizeof(s_wifi_ssid), "%s", CONFIG_ADBLOCK_WIFI_SSID);
        snprintf(s_wifi_pass, sizeof(s_wifi_pass), "%s", CONFIG_ADBLOCK_WIFI_PASSWORD);
        if (nvs_open(NVS_NS, NVS_READWRITE, &h) == ESP_OK) {
            nvs_set_str(h, "wifi_ssid", s_wifi_ssid);
            nvs_set_str(h, "wifi_pass", s_wifi_pass);
            nvs_commit(h);
            nvs_close(h);
        }
    }
}

/* ── Setup AP — zero-touch first-boot Wi-Fi config (#1, mirrors upstream
 * ESP32_AdBlocker's own AP-mode bootstrap) ──────────────────────────────
 * Reborn is Ethernet-first, so most boots never need this: plug in a cable,
 * DHCP hands out an address, the web UI is reachable immediately. The gap is
 * a Wi-Fi-only board with no working credentials yet (blank first boot, or a
 * changed home network) and no Ethernet cable — before this, app_main's
 * xEventGroupWaitBits below used portMAX_DELAY, so that boot hung forever
 * before web_ui_start() ever ran. The only recovery was the USB serial
 * console's `wifi` command, which needs physical access. This starts an open
 * SoftAP (WIFI_MODE_APSTA, so STA keeps retrying and Ethernet is untouched)
 * at the esp-netif default 192.168.4.1 so a phone can join it and reach the
 * SAME httpd server (it listens on all interfaces already) to enter real
 * credentials via the existing Network tab (#54, dns_sink_wifi_set_creds).
 * Torn down automatically the moment ANY interface gets a real IP. */
static bool s_setup_ap_active = false;

