GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
/* WPA2 passphrase for the setup AP (#89). Random, minted once and kept in
 * NVS, printed on the USB console whenever the AP comes up. An OPEN setup AP
 * would let whoever is nearest race the owner to the first-boot wizard and
 * become the admin; with this, reaching the wizard over Wi-Fi needs the
 * console (i.e. the cable) — the same physical-access bar as `admin-reset`. */
static void setup_ap_passphrase(char *out, size_t cap)
{
    nvs_handle_t h;
    size_t len = cap;
    if (nvs_open(NVS_NS, NVS_READWRITE, &h) != ESP_OK) { snprintf(out, cap, "%s", "setup-nvs-fail"); return; }
    if (nvs_get_str(h, "setup_psk", out, &len) != ESP_OK || strlen(out) < 8) {
        static const char alpha[] = "abcdefghjkmnpqrstuvwxyz23456789";   /* no 0/O/1/l/i */
        uint8_t rnd[16]; esp_fill_random(rnd, sizeof(rnd));
        for (int i = 0; i < 16 && i < (int)cap - 1; i++) out[i] = alpha[rnd[i] % (sizeof(alpha) - 1)];
        out[16 < (int)cap - 1 ? 16 : (int)cap - 1] = '\0';
        nvs_set_str(h, "setup_psk", out);
        nvs_commit(h);
    }
    nvs_close(h);
}

static void start_setup_ap(void)
{
    if (s_setup_ap_active) return;
    esp_netif_create_default_wifi_ap();
    wifi_config_t ap_cfg = {};
    static const char *AP_SSID = "ESP32AdBlock-Setup";
    char psk[24]; setup_ap_passphrase(psk, sizeof(psk));
    snprintf(reinterpret_cast<char *>(ap_cfg.ap.ssid), sizeof(ap_cfg.ap.ssid), "%s", AP_SSID);
    snprintf(reinterpret_cast<char *>(ap_cfg.ap.password), sizeof(ap_cfg.ap.password), "%s", psk);
    ap_cfg.ap.ssid_len = strlen(AP_SSID);
    ap_cfg.ap.channel = 1;
    ap_cfg.ap.max_connection = 4;
    ap_cfg.ap.authmode = WIFI_AUTH_WPA2_PSK;
    if (esp_wifi_set_mode(WIFI_MODE_APSTA) != ESP_OK ||
        esp_wifi_set_config(WIFI_IF_AP, &ap_cfg) != ESP_OK) {
        ESP_LOGE(TAG, "setup AP failed to start");
        return;
    }
    s_setup_ap_active = true;
    ESP_LOGW(TAG, "No network link — setup AP \"%s\" is up at 192.168.4.1, "
                  "WPA2 passphrase: %s  (join it and browse https://192.168.4.1 "
                  "to enter real Wi-Fi credentials; it shuts off automatically "
                  "once any interface gets a real IP)", AP_SSID, psk);
}

static void stop_setup_ap_if_active(void)
{
    if (!s_setup_ap_active) return;
    s_setup_ap_active = false;
    esp_wifi_set_mode(WIFI_MODE_STA);
    ESP_LOGI(TAG, "Network link established — setup AP shut off");
}

static NetStaticCfg s_wifi_static;

/* Wi-Fi counterpart of publish_static_eth — see that comment for why this is
 * deferred to association rather than done at config time (#56). */
static void publish_static_wifi(void)
{
    if (s_wifi_static.dhcp) return;
    snprintf(s_wifi_ip,  sizeof(s_wifi_ip),  "%s", s_wifi_static.ip);
    snprintf(s_wifi_nm,  sizeof(s_wifi_nm),  "%s", s_wifi_static.nm);
    snprintf(s_wifi_gw,  sizeof(s_wifi_gw),  "%s", s_wifi_static.gw);
    snprintf(s_wifi_dns, sizeof(s_wifi_dns), "%s", s_wifi_static.dns);
    ESP_LOGI(TAG, "Wi-Fi associated — static IP: %s  GW: %s  DNS: %s",
             s_wifi_ip, s_wifi_gw[0] ? s_wifi_gw : "(none)",
             s_wifi_dns[0] ? s_wifi_dns : "(none)");
    xEventGroupSetBits(s_eth_eg, WIFI_GOT_IP_BIT);
    apply_upstream_iface();
}

/* Suppresses the STA_DISCONNECTED auto-retry across a deliberate reconfigure
 * (set_creds below), so it can't race the new credentials in with the old.
 * Cleared on association rather than synchronously after set_config: the
 * disconnect is asynchronous, so clearing it inline left the handler free to
 * fire its own connect alongside ours (#58). The deadline is a safety net —
 * if the new network never associates, normal auto-retry must resume rather
 * than stay suppressed forever. */
static volatile bool    s_wifi_reconfiguring   = false;
static volatile int64_t s_wifi_recfg_until_us  = 0;

static bool wifi_reconfig_active(void)
{
    if (!s_wifi_reconfiguring) return false;
    if (esp_timer_get_time() > s_wifi_recfg_until_us) {
        s_wifi_reconfiguring = false;      /* expired — resume normal retries */
        return false;
    }
    return true;
}

/* ── Wi-Fi STA bring-up (roadmap #49 slice, extended for concurrent dual-WAN
 * with Ethernet under #53 — both interfaces stay up together rather than
 * one replacing the other). */
static void wifi_event_handler(void *, esp_event_base_t, int32_t event_id, void *)
{
    if (event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
    } else if (event_id == WIFI_EVENT_STA_DISCONNECTED) {
        xEventGroupClearBits(s_eth_eg, WIFI_CONNECTED_BIT | WIFI_GOT_IP_BIT);
        if (!s_wifi_static.dhcp) { s_wifi_ip[0] = '\0'; s_wifi_nm[0] = '\0'; s_wifi_gw[0] = '\0'; s_wifi_dns[0] = '\0'; }
        if (wifi_reconfig_active()) {
            ESP_LOGI(TAG, "Wi-Fi disconnected (reconfiguring — not auto-retrying)");
        } else {
            ESP_LOGW(TAG, "Wi-Fi disconnected — retrying");
            esp_wifi_connect();
        }
    } else if (event_id == WIFI_EVENT_STA_CONNECTED) {
        s_wifi_reconfiguring = false;      /* reconfigure landed */
        xEventGroupSetBits(s_eth_eg, WIFI_CONNECTED_BIT);
        publish_static_wifi();             /* no-op under DHCP — the lease drives it */
    }
}

/* Scan result cache state — declared here because wifi_init_sta() creates the
 * mutex; the worker and the accessors live further down (#62). */
enum ScanState { SCAN_IDLE = 0, SCAN_RUNNING, SCAN_DONE, SCAN_ERROR };
static volatile ScanState  s_scan_state      = SCAN_IDLE;
static SemaphoreHandle_t   s_scan_mutex      = nullptr;
static char                s_scan_json[2560] = "[]";
static int64_t             s_scan_done_us    = 0;
static esp_err_t           s_scan_err        = ESP_OK;

static const char *scan_state_name(ScanState s)
{
    switch (s) {
        case SCAN_RUNNING: return "scanning";
        case SCAN_DONE:    return "done";
        case SCAN_ERROR:   return "error";
        default:           return "idle";
    }
}

static void wifi_init_sta(void)
{
    wifi_creds_init_nvs();
    s_scan_mutex = xSemaphoreCreateMutex();   /* guards the scan result cache (#62) */
    if (!s_scan_mutex) ESP_LOGE(TAG, "scan mutex alloc failed — scanning disabled");
    ESP_LOGI(TAG, "Wi-Fi STA: connecting to SSID \"%s\"", s_wifi_ssid);

    esp_netif_t *wifi_netif = esp_netif_create_default_wifi_sta();

    wifi_init_config_t init_cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&init_cfg));

    ESP_ERROR_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                               wifi_event_handler, nullptr));

    /* Static IP (#55): the netif has to be configured before the driver starts
     * (see apply_static_ip), but the address is only *published* once the STA
     * actually associates — publish_static_wifi, from the event handler (#56). */
    netcfg_load("wifi", &s_wifi_static);
    if (!s_wifi_static.dhcp)
        apply_static_ip(wifi_netif, s_wifi_static);

    wifi_config_t wifi_cfg = {};
    strlcpy(reinterpret_cast<char *>(wifi_cfg.sta.ssid),
            s_wifi_ssid, sizeof(wifi_cfg.sta.ssid));
    strlcpy(reinterpret_cast<char *>(wifi_cfg.sta.password),
            s_wifi_pass, sizeof(wifi_cfg.sta.password));
    wifi_cfg.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_cfg));
    ESP_ERROR_CHECK(esp_wifi_start());
}

/* ── Wi-Fi scan + reconfigure from the web UI (#54) ──────────────────── */

extern "C" void dns_sink_wifi_get_ssid(char *out, size_t cap)
{
    snprintf(out, cap, "%s", s_wifi_ssid);
}

/* ── Wi-Fi scan: worker task + cached result (#62) ────────────────────────
 * The scan used to run blocking inside the httpd task, which stalls *every*
 * viewer for its duration — measured at 3.16s, during which an unrelated page
 * load took 2.63s instead of 0.50s. esp_http_server is single-tasked, so one
 * slow handler is head-of-line blocking for the whole UI.
 *
 * Now a one-shot worker does the scan and publishes the rendered JSON; the
 * httpd handlers only ever touch the cached copy, so they never block. That
 * makes the buffer genuinely shared across tasks (worker writes, httpd reads),
 * hence the mutex — the single-task safety that the other static render
 * buffers rely on does NOT apply here. The lock is held only for the render
 * and the read, never across the scan itself. */
#define WIFI_SCAN_MAX 20

static void wifi_scan_task(void *)
{
    static EXT_RAM_BSS_ATTR wifi_ap_record_t recs[WIFI_SCAN_MAX];   /* only this task touches it */
    wifi_scan_config_t scan_cfg = {};
    esp_err_t rc = esp_wifi_scan_start(&scan_cfg, true /* block — we're off the httpd task */);

