GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
/* Parse question qname → normalized name; return qend offset within DNS msg.
 * IRAM_ATTR (#78): called from l2_input_cb, which must never fault to flash. */
static int IRAM_ATTR l2_qname(const uint8_t *dns, int dns_len, char *out, size_t cap, size_t *outlen)
{
    /* (#114) Was `static`: mutable parser state shared across calls on the
     * Ethernet RX worker task is a reentrancy hazard even though callers are
     * currently serialized. Stack-allocated — 256 bytes is cheap next to the
     * IRAM_ATTR budget this function already accepts. */
    char raw[256];
    int off = 12; size_t rl = 0;
    while (off < dns_len && dns[off] != 0) {
        uint8_t l = dns[off];
        if ((l & 0xC0) == 0xC0) return -1;              /* no compression in question */
        if (l & 0xC0) return -1;                        /* #42: reserved label type */
        if (off + 1 + l > dns_len || rl + l + 1 >= sizeof(raw)) return -1;
        if (rl) raw[rl++] = '.';
        memcpy(raw + rl, dns + off + 1, l); rl += l; off += 1 + l;
    }
    if (off >= dns_len) return -1;
    off++;                                               /* null label */
    if (off + 4 > dns_len) return -1;                    /* qtype + qclass */
    size_t nl = domain_normalize(out, cap, raw, rl);
    if (!nl) return -1;
    *outlen = nl;
    return off + 4;
}

/* IRAM_ATTR (#78): makes the "never touch flash from the L2 hook" invariant
 * explicit rather than relying on CONFIG_LWIP_IRAM_OPTIMIZATION to have
 * caught it incidentally — that setting only covers lwIP's own component
 * sources, not this callback, which esp_eth invokes via a stored function
 * pointer (so it can't be inlined into anything already in IRAM). */
static esp_err_t IRAM_ATTR l2_input_cb(esp_eth_handle_t h, uint8_t *buf, uint32_t len,
                             void *priv, void *info)
{
    (void)info;
    static uint8_t  tx[600];
    static char     name[256];
    do {
        /* Every `break` below hands the frame to lwIP unchanged, which is what
         * keeps this hook honest about the two-verdict-path rule: it may only
         * answer a query it can classify exactly as the socket path would, and
         * anything it cannot classify — a header it will not vouch for, a lock
         * it cannot take, a rewrite it must not render — falls through to the
         * socket path rather than being answered on a guess or dropped here. */
        uint32_t our_ip = s_eth_ip_nbo.load(std::memory_order_relaxed);
        if (!our_ip) break;                              /* (#106) no address yet */
        if (len < 14 + 20 + 8 + 13) break;               /* min IPv4/UDP/DNS */
        if (buf[12] != 0x08 || buf[13] != 0x00) break;   /* IPv4 only */
        if ((buf[14] >> 4) != 4) break;                  /* (#106) IP version nibble */
        int ihl = (buf[14] & 0x0F) * 4;
        if (ihl < 20 || buf[14 + 9] != 17) break;        /* UDP only */
        /* (#106) Length comes from the IP header, never from the frame: Ethernet
         * pads short frames to 60 bytes, so `len - dns` counted padding as DNS
         * payload, and an IP total-length larger than the frame was never
         * rejected at all. */
        int iptot = (buf[16] << 8) | buf[17];
        if (iptot < ihl + 8 || 14 + iptot > (int)len) break;
        /* (#106) Fragments: MF set or a non-zero offset means this frame is not
         * a whole datagram, so the bytes at the UDP/DNS offsets are not what
         * they look like. Reassembly is lwIP's job. */
        if (((buf[20] << 8) | buf[21]) & 0x3FFF) break;
        /* (#106) Only answer what is addressed to us. Without this the hook
         * replied to a query sent to the subnet broadcast — and, since it just
         * swaps the addresses back, replied FROM the broadcast address TO
         * whatever the source claimed to be. */
        uint32_t dst_ip;
        memcpy(&dst_ip, buf + 14 + 16, 4);
        if (dst_ip != our_ip) break;
        /* (#106) A source that cannot receive a unicast reply (0.0.0.0, the
         * all-ones broadcast, or 224/4 multicast) is not a client. */
        uint32_t src_hbo = ((uint32_t)buf[26] << 24) | ((uint32_t)buf[27] << 16) |
                           ((uint32_t)buf[28] << 8)  |  (uint32_t)buf[29];
        if (src_hbo == 0 || src_hbo == 0xFFFFFFFFu || (buf[26] & 0xF0) == 0xE0) break;
        /* (#87) The ACL guards the socket path but never this one, so a client
         * excluded from DNS still got blocked verdicts and cached answers over
         * Ethernet — the fast path only failed to answer on a cold miss, where
         * it fell through to the ACL-protected socket. Provable permission is
         * required to answer here; denied OR unknown defers to that socket,
         * which drops the query if it really is denied. */
        if (!acl_permits_nb(src_hbo)) break;
        int udp = 14 + ihl;
        if (((buf[udp + 2] << 8) | buf[udp + 3]) != 53) break;   /* dst port 53 */
        int udplen = (buf[udp + 4] << 8) | buf[udp + 5];         /* (#106) */
        if (udplen < 8 + 12 || udp + udplen > 14 + iptot) break;
        int dns = udp + 8, dns_len = udplen - 8;
        if (buf[dns + 2] & 0x80) break;                  /* must be a query (QR=0) */
        if (((buf[dns + 4] << 8) | buf[dns + 5]) != 1) break;    /* qdcount==1 */
        size_t nlen = 0;
        int qend = l2_qname(buf + dns, dns_len, name, sizeof(name), &nlen);
        if (qend < 0) break;
        uint16_t qtype = (buf[dns + qend - 4] << 8) | buf[dns + qend - 3];
        if (qtype != 1 && qtype != 28) break;            /* A / AAAA only */
        uint16_t qclass = (buf[dns + qend - 2] << 8) | buf[dns + qend - 1];
        if (qclass != 1) break;                          /* (#106) class IN only */
        /* (#102) The socket path consults the rewrite table before the
         * blocklist, so a name that is both rewritten and blocklisted answers
         * with the configured address there — while this path went straight to
         * the blocklist and answered 0.0.0.0, making the verdict depend on
         * which transport the client happened to use. Test the same table here
         * and, on a match, defer: the answer is then built by the one
         * build_rewrite_a() in the socket path instead of a second copy in
         * IRAM. `-1` (table busy) defers too — same fail-to-the-slow-path rule
         * as everywhere else in this hook. */
        if (qtype == 1) {
            uint32_t rw = 0;
            if (rewrite_lookup_nb(name, nlen, &rw) != 0) break;
        }
        if (!blocklist_is_blocked_nb(name, nlen)) {      /* not blocked → try L2 cache, else lwIP */
            /* Forward-cache hit answered straight from L2, skipping lwIP — the
             * same socket-stack overhead the blocked path already bypasses. Lay
             * the eth+ip+udp headers into tx, then the seqlock-protected reader
             * copies the cached DNS reply right after them. Miss/race → lwIP. */
            int clen = dns_cache_l2_get(domain_hash(name, nlen), qtype,
                                        tx + dns, (int)sizeof(tx) - dns);
            if (clen <= 0) break;                        /* miss/expired/race → lwIP */
            memcpy(tx, buf, dns);                         /* eth+ip+udp headers */
            uint8_t s6[6]; memcpy(s6,tx,6); memcpy(tx,tx+6,6); memcpy(tx+6,s6,6);            /* swap MAC */
            uint8_t s4[4]; memcpy(s4,tx+14+12,4); memcpy(tx+14+12,tx+14+16,4); memcpy(tx+14+16,s4,4); /* swap IP */
            uint8_t s2[2]; memcpy(s2,tx+udp,2); memcpy(tx+udp,tx+udp+2,2); memcpy(tx+udp+2,s2,2);     /* swap ports */
            tx[dns] = buf[dns]; tx[dns+1] = buf[dns+1];   /* patch txid to this query */
            int iptot_c = ihl + 8 + clen;
            tx[14+2]=(iptot_c>>8); tx[14+3]=(iptot_c&0xFF);
            int udplen_c = 8 + clen;
            tx[udp+4]=(udplen_c>>8); tx[udp+5]=(udplen_c&0xFF);
            tx[udp+6]=0; tx[udp+7]=0;                     /* zero UDP checksum (legal IPv4) */
            tx[14+10]=0; tx[14+11]=0;                     /* IP checksum */
            uint32_t csum=0;
            for (int i=0;i<ihl;i+=2) csum += (tx[14+i]<<8)|tx[14+i+1];
            while (csum>>16) csum=(csum&0xFFFF)+(csum>>16);
            uint16_t cks=~csum; tx[14+10]=(cks>>8); tx[14+11]=(cks&0xFF);
            if (esp_eth_transmit(h, tx, dns + clen) != ESP_OK) s_l2_tx_fail++;
            s_l2_cached++;
            free(buf);                                    /* consumed (== eth_l2_free) */
            return ESP_OK;
        }

        /* ── craft blocked response in tx ── */
        int rdlen = (qtype == 28) ? 16 : 4;
        int dns_resp = qend + 12 + rdlen;                /* question + answer RR */
        int frame = dns + dns_resp;
        if (frame > (int)sizeof(tx)) break;
        memcpy(tx, buf, dns + qend);                     /* eth+ip+udp+dns(hdr+question) */
        uint8_t t6[6];
        memcpy(t6, tx, 6); memcpy(tx, tx + 6, 6); memcpy(tx + 6, t6, 6);          /* swap MAC */
        uint8_t t4[4];
        memcpy(t4, tx+14+12, 4); memcpy(tx+14+12, tx+14+16, 4); memcpy(tx+14+16, t4, 4); /* swap IP */
        uint8_t t2[2];
        memcpy(t2, tx+udp, 2); memcpy(tx+udp, tx+udp+2, 2); memcpy(tx+udp+2, t2, 2);     /* swap ports */
        { uint16_t qf = (buf[dns+2] << 8) | buf[dns+3];
          uint16_t rf = dns_resp_flags(qf, 0);
          tx[dns+2] = (rf >> 8); tx[dns+3] = (rf & 0xFF); }
        tx[dns+6] = 0; tx[dns+7] = 1;                    /* ancount=1 */
        tx[dns+8] = 0; tx[dns+9] = 0; tx[dns+10] = 0; tx[dns+11] = 0;  /* ns/ar=0 */
        uint8_t *a = tx + dns + qend;
        a[0]=0xC0; a[1]=0x0C; a[2]=(qtype>>8); a[3]=(qtype&0xFF);
        a[4]=0; a[5]=1; a[6]=0; a[7]=0; a[8]=0; a[9]=10;             /* class IN, ttl 10 */
        a[10]=(rdlen>>8); a[11]=(rdlen&0xFF);
        memset(a+12, 0, rdlen);                          /* 0.0.0.0 / :: */
        int iptot_b = ihl + 8 + dns_resp;
        tx[14+2]=(iptot_b>>8); tx[14+3]=(iptot_b&0xFF);
        int udplen_b = 8 + dns_resp;
        tx[udp+4]=(udplen_b>>8); tx[udp+5]=(udplen_b&0xFF);
        tx[udp+6]=0; tx[udp+7]=0;                        /* zero UDP checksum (legal IPv4) */
        tx[14+10]=0; tx[14+11]=0;                        /* IP checksum */
        uint32_t sum=0;
        for (int i=0;i<ihl;i+=2) sum += (tx[14+i]<<8)|tx[14+i+1];
        while (sum>>16) sum=(sum&0xFFFF)+(sum>>16);
        uint16_t csum=~sum;
        tx[14+10]=(csum>>8); tx[14+11]=(csum&0xFF);

        if (esp_eth_transmit(h, tx, frame) != ESP_OK) s_l2_tx_fail++;
        s_l2_blocked++;
        free(buf);                                       /* we consumed it (== eth_l2_free) */
        return ESP_OK;
    } while (0);

    return esp_netif_receive((esp_netif_t *)priv, buf, len, NULL);
}

/* Init-failure halt, made OTA-rollback-aware (#1). Plain portMAX_DELAY halt
 * loops here would defeat CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE: rollback
 * only fires on the NEXT reset, and a halted board never resets, so a bad OTA
 * image that fails init would hang forever on the safety net instead of being
 * reverted by it. If the running partition is still ESP_OTA_IMG_PENDING_VERIFY
 * (a freshly-OTA'd image that never reached esp_ota_mark_app_valid_cancel_
 * rollback below), roll back and reboot immediately instead of halting.
 * On an already-confirmed partition (state != PENDING_VERIFY — normal boot,
 * hardware fault unrelated to OTA) there's nothing safe to roll back to, so
 * this still just halts, same as before. */
static void halt_or_rollback(const char *reason)
{
    ESP_LOGE(TAG, "%s — halting", reason);
    esp_ota_img_states_t state;
    const esp_partition_t *running = esp_ota_get_running_partition();
    if (running && esp_ota_get_state_partition(running, &state) == ESP_OK &&
        state == ESP_OTA_IMG_PENDING_VERIFY) {
        ESP_LOGE(TAG, "unconfirmed OTA image — rolling back to the previous slot");
        esp_ota_mark_app_invalid_rollback_and_reboot();   /* does not return on success */
    }
    for (;;) vTaskDelay(portMAX_DELAY);
}

/* ── app_main ────────────────────────────────────────────────────── */
extern "C" void app_main(void)
{
    /* NVS */
    esp_err_t r = nvs_flash_init();
    if (r == ESP_ERR_NVS_NO_FREE_PAGES || r == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        r = nvs_flash_init();
    }
    ESP_ERROR_CHECK(r);

    /* #75: seed the clock from max(last-known-good NVS epoch, build stamp)
     * BEFORE anything can open a TLS connection. Certificate not-before /
     * not-after checks read the system clock, and until this ran that clock
     * said 1970 — the earliest possible point after NVS is the only place this
     * belongs. It is a floor, not a sync: timesync_is_synced() stays false, so
     * the query log and web UI still refuse to date anything until NTP lands. */
    timesync_floor_init();

    /* Event loop + netif */
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

