GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    s_eth_eg = xEventGroupCreate();

    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, ESP_EVENT_ANY_ID,
                                               ip_event_handler, nullptr));

    /* Register Ethernet event handler */
    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                               eth_event_handler, nullptr));

    /* Init W5500 + create default Ethernet netif (DHCP client). Always brought
     * up — the L2 fast-path and LAN-facing IP (mDNS, router DNS target, web UI)
     * live here regardless of whether Wi-Fi is also enabled. */
    esp_eth_handle_t eth_handle = eth_init_w5500();
    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);
    esp_netif_attach(eth_netif, esp_eth_new_netif_glue(eth_handle));
    /* Override the glue's input with our L2 fast-path hook (passthrough for now) */
    ESP_ERROR_CHECK(esp_eth_update_input_path_info(eth_handle, l2_input_cb, eth_netif));

    /* Static IP (#55): the netif has to be configured before the driver starts
     * (see apply_static_ip), but the address is only *published* once the link
     * actually comes up — publish_static_eth, from the event handler (#56). */
    netcfg_load("eth", &s_eth_static);
    if (!s_eth_static.dhcp)
        apply_static_ip(eth_netif, s_eth_static);
    ESP_ERROR_CHECK(esp_eth_start(eth_handle));

#if CONFIG_ADBLOCK_NET_WIFI
    /* Wi-Fi STA bring-up alongside Ethernet (#53: dual-WAN). No L2 fast-path
     * here — Wi-Fi queries take the normal lwIP socket path. */
    wifi_init_sta();

    /* Wait for EITHER interface, not both — the Ethernet cable may not be
     * plugged in at all (Wi-Fi-only operation is a supported mode, not just
     * a transient boot state), so blocking on both would hang forever with
     * no cable connected. Whichever interface comes up later still fires its
     * own IP_EVENT and joins in (apply_upstream_iface() re-runs each time).
     *
     * Bounded, not portMAX_DELAY (#1): a board with no Ethernet cable AND no
     * working Wi-Fi credentials (blank first boot, or a changed home network)
     * would otherwise hang HERE forever — nothing past this line ever runs,
     * including web_ui_start(), so the only recovery was the USB serial
     * console. On timeout, bring up the setup AP (start_setup_ap) so the
     * device is reachable over Wi-Fi with zero prior config — mirrors
     * upstream ESP32_AdBlocker's own AP-mode bootstrap — then give it one
     * more bounded window before continuing regardless: booting with no
     * upstream reachable yet is already a supported state (see Wi-Fi-only,
     * no-cable above), just newly reachable via the AP instead of USB. */
    ESP_LOGI(TAG, "Waiting for Ethernet or Wi-Fi link and DHCP...");
    EventBits_t link_bits = xEventGroupWaitBits(s_eth_eg, ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT,
                        pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_SETUP_AP_TIMEOUT_MS));
    if (!(link_bits & (ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT))) {
        start_setup_ap();
        xEventGroupWaitBits(s_eth_eg, ETH_GOT_IP_BIT | WIFI_GOT_IP_BIT,
                            pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_SETUP_AP_TIMEOUT_MS));
    }
    ESP_LOGI(TAG, "Network ready — Ethernet: %s  Wi-Fi: %s",
             s_ip[0] ? s_ip : "(down)", s_wifi_ip[0] ? s_wifi_ip : "(down)");
#else
    /* Wait for link + DHCP lease */
    ESP_LOGI(TAG, "Waiting for Ethernet link and DHCP...");
    xEventGroupWaitBits(s_eth_eg, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT,
                        pdFALSE, pdTRUE, portMAX_DELAY);
    ESP_LOGI(TAG, "Network ready — IP: %s", s_ip);
#endif

    upstream_iface_init_nvs();

#if CONFIG_ADBLOCK_NET_WIFI
    /* #80: the wait above returns as soon as EITHER interface has an IP - that
     * is deliberate, since a cable-out Wi-Fi-only boot is a supported mode, not
     * just a transient. But it means a fast Wi-Fi lease can let us proceed
     * while the interface we actually egress through is still waiting on DHCP,
     * which made the banner below report a fallback resolver and advertise the
     * wrong LAN IP. Give the SELECTED interface a bounded second chance; a
     * genuinely absent link still boots, it just says so out loud. */
    {
        const EventBits_t want = (strcmp(s_upstream_iface, "wifi") == 0)
                               ? WIFI_GOT_IP_BIT : ETH_GOT_IP_BIT;
        if (!(xEventGroupGetBits(s_eth_eg) & want)) {
            ESP_LOGI(TAG, "Upstream interface (%s) has no lease yet - waiting up to %d s",
                     s_upstream_iface, UPSTREAM_IFACE_WAIT_MS / 1000);
            EventBits_t got = xEventGroupWaitBits(s_eth_eg, want, pdFALSE, pdFALSE,
                                                  pdMS_TO_TICKS(UPSTREAM_IFACE_WAIT_MS));
            if (!(got & want))
                ESP_LOGW(TAG, "Upstream interface (%s) still has no lease after %d s - "
                              "starting on the fallback resolver; it re-points "
                              "automatically when DHCP lands",
                         s_upstream_iface, UPSTREAM_IFACE_WAIT_MS / 1000);
        }
    }
#endif

    /* (raw W5500 TX floor measured at ~400us/frame, 2497fps — bus has ~5x
     *  headroom over our ~527qps; the gap is the lwIP per-query path.) */

    /* SNTP: get real wall-clock time so the query log carries dated timestamps.
     * Lightweight built-in lwIP SNTP (one UDP socket). Resolves via the board's
     * own DHCP DNS, not our sinkhole, so it works even before the blocklist loads.
     *
     * #75 moved this up from after web_ui_start(): it only needs an IP and the
     * DHCP resolver, both of which are true here, and starting it this early
     * shortens the window in which TLS clients (DoT on the DNS task, the
     * blocklist fetch) are running on the floor rather than on real time. */
    timesync_start();

    /* Allocate PSRAM ping-pong buffers */
    if (!blocklist_init()) {
        halt_or_rollback("PSRAM blocklist init failed");
    }
    rewrite_init();
    localzone_init_nvs();
    dot_init_nvs();
    acl_init();
    query_log_init();

    /* Mount SD card (SPI3 — separate bus from W5500) */
    sd_mount();

